{"podcast_details": {"podcast_title": "Business Wars", "episode_title": "Listen Now - Think Twice: Michael Jackson", "episode_image": "https://content.production.cdn.art19.com/images/e9/a8/b3/de/e9a8b3de-70e7-4e67-9c8c-b1da4700df4e/33620a2e847a82f97703a7e373fc349cacefeeb77c74fc8efe826a117e4dc56e4ca8b06e424a4550c9de0ed03e2f73c8904ad337ae01c40a7cd7ab0d8fc65cec.jpeg", "episode_transcript": " Hey listeners, there's a new podcast I think you'd like. His music united the world, but his legacy divides it. Since Michael Jackson's death in 2009, the world has struggled with how he should be remembered as the king of pop or as a monster. Hosted by Leon Naefaq and Jay Smoothe, this new podcast, Think Twice Michael Jackson, presents a new account of the MJ story. In this 10-part narrative series, they explore the enigma of Michael Jackson's persona, exploring the complexities that make him seemingly uncancellable. Through dozens of original interviews with people who watched the Michael Jackson story unfold firsthand. Think Twice offers a new perspective on the art and the artist. From his extraordinary life and groundbreaking music to the contentious legacy he left behind, Think Twice examines it all. You're about to hear a clip from Think Twice. While you're listening, follow Think Twice wherever you get your podcasts or you can binge the entire series ad-free on Audible or the Amazon Music app. Good evening, I'm Kim Lomstocking. And I'm Douglas E. Doug. The comedian Doug E. Doug was having a huge year when he appeared as a presenter at the NAACP Image Awards in January of 1994. Doug was just 23 years old. One can argue I was at the height of my career because that's the reason why they invited me. Crew Runners had come out, it was a huge global hit. I played Sanka Coffee, the greatest pushcart driver in all of Jamaica. Doug's role at the ceremony was to give out the award for Outstanding Female Artist, which everyone knew was going to go to Whitney Houston for the Bodyguard soundtrack. If this woman wins, I'm going to bow down and kiss her feet. Get to kissing Whitney Houston for the Bodyguard soundtrack! Doug actually did kiss Whitney Houston's feet when she came to the stage, and he was expecting that to be the most surreal encounter he'd have with a celebrity that night. Then he realized, along with everyone else in the audience, that someone even more famous was in the building. One of the greatest dancer, choreographers in history, the biggest selling recording artist in the world, the King of Pop, rockin' soul, Mr. Michael Jackson. Michael Jackson hadn't been seen in public in months. As he walked onto the stage, smiling, with his hands behind his back, the entire auditorium exploded in cheering and applause. Only thing comparable to it would have been like, the Pope. It was kind of a meta experience, because you're around people who you think are big. And you're just like, oh wow, there's Bumma Bumma, there's Bumma Bumma. And then Michael comes, and everybody's like, he's big, he's really big. Dressed in a white V-neck under a militaristic blazer with big gold buttons, Michael waved and blew kisses as the crowd began chanting his name. He looked like he was a man of the future. He was just kind of like, oh my God, it's Michael Jackson. He was beyond a person. And we're talking about among the biggest entertainers at that time. It was an anomaly, culturally, racially, socially, musically. Doug had loved Michael Jackson's music his entire life. In some ways, he had formed his sense of his own future based on Michael's success. For a young black boy, he was like an avatar for possibility, you know. If he's as high as you can go, then you can just go high. For Doug, seeing Michael appear directly in front of him at the NAACP awards felt like proof he had really made it. I think for me, it was like, never in my life did I think that I would be anywhere near this man. And I think a lot of other people, I think, were like, oh my God, I'm going to be anywhere near this man. And I think a lot of other people felt that way. Like, I must be really successful because I'm like near Michael Jackson. As the applause continued, a camera zoomed across the crowd and swung past Doug, who looked like he was in the middle of a full-blown freakout. Years later, a short clip of Doug screaming and smiling and bouncing up and down on his heels would become a viral internet meme meant to indicate uncontrollable excitement. Most people who share it probably have no idea Doug was taking part in a minute-long standing ovation for Michael Jackson. Thank you for your warm and generous support. I love you very much. It was a charged moment. Michael wasn't even supposed to be at the Image Awards. He wasn't nominated for anything, and he wasn't there to perform. But here he was, on stage, and no one knew what was going to happen next. Finally, after getting his fill of applause, Michael bent down toward the microphone and got serious. For decades, the NAACP had stood at the forefront of the struggle for equal justice under the law. Members of the NAACP have been jailed and even killed in the noble pursuit of those ideals upon which our country was founded. None of these goals is more meaningful for me at this time in my life than the notion that everyone is presumed to be innocent. The Los Angeles Police Department initiated a criminal investigation of entertainer Michael Jackson. About four months earlier, in August of 1993, Michael Jackson had been accused of molesting a 13-year-old child. Michael had not been charged or arrested, but it was still possible that he would be. Now, he was calling on his audience to rally behind him in the face of persecution, and asking them to view him as a victim of injustice. Everyone is presumed to be innocent and totally innocent until they are charged with a crime and then convicted by a jury of their peers. Looking out from behind the podium, Michael addressed not only the famous black artists and entertainment executives in the room with him, but also the audience watching the NBC broadcast of the show from home. I never really took the time to understand the importance of that ideal until now, until I became the victim of false allegations. And the willingness of others to believe and exploit the worst before they have had the chance to hear the truth. Michael giggled at all the shouting, and when someone broke through the noise with an I love you, he replied the way he often did, by saying I love you more. Then he brought a speech in for a landing. Because not only am I presumed to be innocent, I am innocent. Together we will see this thing through, and I'm very proud to be here. And I'm very proud to be here."}, "podcast_summary": "The podcast is called \"Think Twice Michael Jackson\" and it aims to present a new perspective on the life and legacy of Michael Jackson. It explores the complexities surrounding him and features interviews with people who witnessed his story firsthand. The podcast delves into his extraordinary life, groundbreaking music, and the controversial legacy he left behind. In a specific clip discussed, comedian Doug E. Doug recounts his experience at the NAACP Image Awards in 1994, where he encountered Whitney Houston and then Michael Jackson. The podcast provides insight into the anticipation and excitement generated by Michael's appearance, his call for support in the face of molestation accusations, and his assertion of innocence.", "podcast_guest": "Douglas E. Doug", "podcast_highlights": "In this podcast episode, the hosts introduce a new podcast called \"Think Twice Michael Jackson,\" which explores the enigma of Michael Jackson's persona and his complex legacy. The series consists of 10 parts and features original interviews with individuals who witnessed the story of Michael Jackson unfold firsthand.\n\nThe episode then delves into a specific moment at the NAACP Image Awards in January 1994. Comedian Doug E. Doug, who was experiencing great success at the time, shares his experience at the awards ceremony. He was tasked with presenting the Outstanding Female Artist award, which was expected to go to Whitney Houston for the Bodyguard soundtrack.\n\nHowever, the most surreal encounter of the night occurred when Michael Jackson was unexpectedly present at the event. As Michael took the stage, the entire auditorium erupted in cheers and applause. Doug E. Doug, a lifelong fan of Michael Jackson, describes the profound impact the singer had on him and many others. The moment seemed to validate Doug's own success and aspirations.\n\nAfter the applause subsided, Michael addressed the audience, acknowledging the NAACP's role in fighting for equal justice under the law. He then mentioned that he was being investigated by the Los Angeles Police Department for allegations of child molestation. Michael called upon his audience to support him and emphasized the importance of the presumption of innocence until proven guilty.\n\nThe episode concludes with Michael expressing his gratitude and stating his belief in his own innocence."}